package com.tetris;


public class Линия {
    private Координата[] координата;
    private Field field;
    private boolean фигураНеПеревернута = true;

    public Линия(Field field) {

        координата = new Координата[3];
        координата[0] = new Координата(0, 3);
        координата[1] = new Координата(0, 4);
        координата[2] = new Координата(0, 5);

        this.field = field;
        двигатьсяВниз();
    }

    public void перевернутьВлево() {
        if (фигураНеПеревернута) {
            Координата[] новаяКоордината = new Координата[3];
            новаяКоордината[0] = new Координата(this.координата[0].getX() + 1, this.координата[0].getY() + 1);
            новаяКоордината[1] = new Координата(this.координата[1].getX(), this.координата[1].getY());
            новаяКоордината[2] = new Координата(this.координата[2].getX() - 1, this.координата[2].getY() - 1);
            this.координата = field.moveToPosition(новаяКоордината, this.координата, 'Z');
            this.фигураНеПеревернута = false;
        } else {
            Координата[] новаяКоордината = new Координата[3];
            новаяКоордината[0] = new Координата(this.координата[0].getX() - 1, this.координата[0].getY() - 1);
            новаяКоордината[1] = new Координата(this.координата[1].getX(), this.координата[1].getY());
            новаяКоордината[2] = new Координата(this.координата[2].getX() + 1, this.координата[2].getY() + 1);
            this.координата = field.moveToPosition(новаяКоордината, this.координата, 'Z');
            this.фигураНеПеревернута = true;
        }
    }

    public void перевернутьВправо() {
        this.перевернутьВлево();
    }

    public Координата[] getКоордината() {
        return координата;
    }

    public void двигатьсяВниз() {
        Координата[] новаяКоордината = new Координата[3];
        новаяКоордината[0] = new Координата(this.координата[0].getX() + 1, this.координата[0].getY());
        новаяКоордината[1] = new Координата(this.координата[1].getX() + 1, this.координата[1].getY());
        новаяКоордината[2] = new Координата(this.координата[2].getX() + 1, this.координата[2].getY());
        this.координата = field.moveToPosition(новаяКоордината, this.координата, 'Z');
    }
}
